//Version: 1.0.4 
let emwatchlist = (_GetWatchlist('EmergencyAccounts') 
| project EmergencyAccount); 
SigninLogs 
| project IPAddress, Location, AppDisplayName, UserPrincipalName 
| where UserPrincipalName in (emwatchlist)